20230831072420-distributed_denial_of_service_attack_ddos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 09:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Distributed Denial-of-Service Attack (DDoS)</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Distributed Denial-of-Service Attack (DDoS)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7dc6ede">1. Examples in history:</a>
<ul>
<li><a href="#org7fab4e9">1.1. 2020 AWS</a></li>
<li><a href="#org8e88230">1.2. 2018 Github</a></li>
<li><a href="#orgb74dbb1">1.3. 2017 Google Cloud</a></li>
<li><a href="#org7700c77">1.4. 2016 Dyn DNS Service</a></li>
<li><a href="#orgc943265">1.5. 2015 Github</a></li>
<li><a href="#org28bbd8e">1.6. 2013 Spamhaus</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
<a href="20230831071621-denial_of_service_attack_dos.html#ID-075ef02e-9d9b-418d-be84-9ca16a1bd79f">DoS Attack</a> using <b>multiple</b> systems.
</p>

<p>
And they're usually helped by <a href="20230831063644-botnets.html#ID-ca248324-6746-4bdd-994c-42f69cb33f8d">botnet</a> attackers.
</p>

<div id="outline-container-org7dc6ede" class="outline-2">
<h2 id="org7dc6ede"><span class="section-number-2">1.</span> Examples in history:</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org7fab4e9" class="outline-3">
<h3 id="org7fab4e9"><span class="section-number-3">1.1.</span> 2020 AWS</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The AWS Shield Threat Landscape Report for Q1 of 2020 described the largest DDoS attack to date.
</p>

<p>
AWS cloud servers were inundated by incoming traffic at a rate of 2.3 Tbps over a three day period.
</p>

<p>
The peak of the attack was 44% larger than anything the AWS Shield service has experienced previously.
</p>

<p>
The DDoS attack target was an undisclosed AWS cloud platform customer.
</p>

<p>
Attackers took over <a href="20230831072824-connection_less_lightweight_directory_access_protocol_cldap.html#ID-7539b2da-ff52-4ee9-944d-940d75b61462">CLDAP</a> web servers.
In recent years, numerous DDoS assaults have utilized <a href="20230831072824-connection_less_lightweight_directory_access_protocol_cldap.html#ID-7539b2da-ff52-4ee9-944d-940d75b61462">CLDAP</a>.
</p>
</div>
</div>

<div id="outline-container-org8e88230" class="outline-3">
<h3 id="org8e88230"><span class="section-number-3">1.2.</span> 2018 Github</h3>
<div class="outline-text-3" id="text-1-2">
<p>
This attack sent 126.9 million packets per second, reaching a throughput of 1.3 Tbps.
</p>

<p>
This DDoS attack used <code>memcaching</code>, which takes advantage of a database caching system for an amplified attack impact.
</p>

<p>
The attackers were able to magnify their attack by a factor of around 50,000x by saturating memcached servers with bogus queries.
</p>

<p>
Github’s DDoS security provider successfully alerted the company within 10 minutes of the onset, allowing Github to quickly stop the assault and work to restore operations.
</p>
</div>
</div>

<div id="outline-container-orgb74dbb1" class="outline-3">
<h3 id="orgb74dbb1"><span class="section-number-3">1.3.</span> 2017 Google Cloud</h3>
<div class="outline-text-3" id="text-1-3">
<p>
This DDoS attack against Google Cloud services generated a magnitude of 2.54 Tbps.
</p>

<p>
Approximately <b>180,000</b> web servers were targeted by the attackers, who used fake packets to send responses to Google.
</p>

<p>
The attack was not an isolated occurrence.
</p>

<p>
During the previous six months, the perpetrators had launched many DDoS attacks against Google's infrastructure.
</p>
</div>
</div>

<div id="outline-container-org7700c77" class="outline-3">
<h3 id="org7700c77"><span class="section-number-3">1.4.</span> 2016 Dyn DNS Service</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Numerous notable websites, including Netflix, The New York Times, PayPal, Amazon, Airbnb, Reddit, Visa, and GitHub experienced downtime as a result of this destructive attack from malware known as <a href="20230831073049-mirai.html#ID-a0c23a8c-6187-443d-aa7b-67338cf09d0e">Mirai</a>.
</p>

<p>
The malware configured the infected <a href="20230831073110-internet_of_things_iot.html#ID-4e44f12e-f1aa-486a-a596-573347cc172d">IoT</a> devices to make queries to Dyn in order to generate the attack traffic.
</p>

<p>
Thankfully, Dyn was able to stop the attack in one day, but the attack's purpose was never identified.
</p>
</div>
</div>


<div id="outline-container-orgc943265" class="outline-3">
<h3 id="orgc943265"><span class="section-number-3">1.5.</span> 2015 Github</h3>
<div class="outline-text-3" id="text-1-5">
<p>
This DDoS attack was politically motivated and persisted for several days.
</p>

<p>
The attack adapted itself to circumvent Github’s DDoS mitigation measures.
</p>

<p>
The DDoS activity came from <b>China</b> and was directed at two GitHub projects that were trying to avoid Chinese government censorship.
</p>

<p>
It is believed that the goal of the attack was to exert pressure on GitHub to terminate such projects.
</p>

<p>
Cybercriminals used <a href="20230831073232-baidu.html#ID-8cca6fb2-60e7-40bd-983b-4df5bac6ae01">Baidu</a>, to generate attack traffic by injecting <b>JavaScript</b> code into users' browsers.
</p>

<p>
Websites that used <a href="20230831073232-baidu.html#ID-8cca6fb2-60e7-40bd-983b-4df5bac6ae01">Baidu's</a>  web traffic analytics services were used to inject malicious code in place of harmless visitor tracking scripts.
</p>

<p>
The code then prompted the affected browsers to make repeated <a href="20230826085737-hyper_text_transfer_protocl.html#ID-d9ee14c8-ce84-46a5-9c63-4b1903d9866b">HTTP</a> requests to the targeted GitHub pages.
</p>
</div>
</div>


<div id="outline-container-org28bbd8e" class="outline-3">
<h3 id="org28bbd8e"><span class="section-number-3">1.6.</span> 2013 Spamhaus</h3>
<div class="outline-text-3" id="text-1-6">
<p>
An organization that aids in the fight against spam emails and spam-related behavior, fell victim in 2013 to what was then the largest DDoS attack to-date.
</p>

<p>
People who make money from spam emails commissioned the offense on the spam filtering service.
</p>

<p>
Spamhaus experienced <b>300 Gbps</b> of incoming internet traffic during the attack.
</p>

<p>
When the assault started, Spamhaus registered for Cloudflare, whose DDoS defense successfully reduced the volume of the bogus incoming traffic.
</p>

<p>
In an effort to take down Cloudflare, the attackers retaliated by targeting specific Internet exchanges and bandwidth suppliers.
</p>

<p>
Although this assault's objective was not met, it did serious harm to <a href="20230831073427-london_internet_exchange_linx.html#ID-bba5be7f-57f3-4eb0-8c70-1b550aba3ee9">LINX</a>
</p>

<p>
The primary attacker hired to organize this offense turned out to be a British teenager.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
